In [2]:
from sqlalchemy import create_engine
import pandas as pd
import pymysql

engine = create_engine("mysql+pymysql://root:localpassword@172.17.0.1:3306/lahman2016")
    
conn = engine.connect()

### The Lahman Database consists of the following tables:

In [4]:
engine.table_names()

['AllstarFull',
 'Appearances',
 'AwardsManagers',
 'AwardsPlayers',
 'AwardsShareManagers',
 'AwardsSharePlayers',
 'Batting',
 'BattingPost',
 'CollegePlaying',
 'Fielding',
 'FieldingOF',
 'FieldingOFsplit',
 'FieldingPost',
 'HallOfFame',
 'HomeGames',
 'Managers',
 'ManagersHalf',
 'Master',
 'Parks',
 'Pitching',
 'PitchingPost',
 'Salaries',
 'Schools',
 'SeriesPost',
 'Teams',
 'TeamsFranchises',
 'TeamsHalf']

# Salaries

In [14]:
'''
What is the playerID, year, and salary of the 
largest single year contract?
''' 

sql_query = """
SELECT *
FROM Salaries
;
"""

from_sql = pd.read_sql_query(sql_query,conn)
from_sql.head()

   yearID teamID lgID   playerID  salary
0    1985    ATL   NL  barkele01  870000
1    1985    ATL   NL  bedrost01  550000
2    1985    ATL   NL  benedbr01  545000
3    1985    ATL   NL   campri01  633333
4    1985    ATL   NL  ceronri01  625000

In [11]:
# Answer

sql_query = """
SELECT playerID, yearID, salary
FROM Salaries
ORDER BY salary desc
LIMIT 1
;
"""

from_sql = pd.read_sql_query(sql_query,conn)
from_sql.head()

    playerID  yearID    salary
0  rodrial01    2009  33000000

In [ ]:
'''
What is the playerID and total salary of the player
with the largest lifetime earnings?
''' 

sql_query = """
SELECT *
FROM Salaries
;
"""

from_sql = pd.read_sql_query(sql_query,conn)
from_sql.head()

In [17]:
# Answer

sql_query = """
SELECT playerID, SUM(salary)
FROM Salaries
GROUP BY playerID
ORDER BY SUM(salary) desc
LIMIT 1
;
"""

from_sql = pd.read_sql_query(sql_query,conn)
from_sql.head()

    playerID  SUM(salary)
0  rodrial01  398416252.0

In [ ]:
'''
What is the Average Salary by year?
'''

sql_query = """
SELECT *
FROM Salaries
;
"""

from_sql = pd.read_sql_query(sql_query,conn)
from_sql.head()

In [19]:
# Answer

sql_query = """
SELECT yearID, AVG(salary)
FROM Salaries
WHERE salary IS NOT NULL AND salary != 0
GROUP BY yearID
;
"""

from_sql = pd.read_sql_query(sql_query,conn)
from_sql.head()

   yearID  AVG(salary)
0    1985  476299.4473
1    1986  417147.0434
2    1987  434729.4657
3    1988  453171.0769
4    1989  506323.0816

In [ ]:
'''
What is the median Salary in 1987?
(Difficult)
'''

sql_query = """
SELECT *
FROM Salaries
;
"""

from_sql = pd.read_sql_query(sql_query,conn)
from_sql.head()

In [37]:
# Answer
sql_query = """
SELECT yearID, playerID, salary, rank

FROM
(SELECT s1.yearID, s1.playerID, s1.salary, COUNT(s2.salary) as rank

FROM Salaries as s1
JOIN Salaries as s2 on (s1.salary < s2.salary) OR
(s1.playerID > s2.playerID AND s1.salary=s2.salary)

WHERE s1.yearID = 1987 AND s2.yearID = 1987
GROUP BY s1.playerID, s1.salary
ORDER BY rank asc) rankedsalary

WHERE rank = (SELECT ROUND(COUNT(salary)/2)
                FROM Salaries WHERE yearID=1987 AND salary IS NOT NULL)
;
"""

from_sql = pd.read_sql_query(sql_query,conn)
from_sql.head()

   yearID   playerID  salary  rank
0    1987  masonmi01  280000   314